[
    {
        "tab": ["SMALL<br>BEGINNINGS", "LEFT<br>4 DEV", "CONTENT<br>CREATOR"],
        "header": ["SMALL BEGINNINGS", "LEFT 4 DEV", "CONTENT CREATOR"],
        "content": ["From my earliest memories, I had always had an obsession with technology, primarily imposed onto me by my late Father, who was a huge nerd and inspiration for my eventual career path, even though he had nothing to do with it himself. <br><br> My earliest foray into the realm of computer science was probably my time with Half-Life 2, or, more specifically, a mod turned game for it called Garry's Mod, in the early 2010s, around the age of 10-12. It ran on a reconstructed / highly edited version of Lua very creatively named gLua. While I never learned it much indepth, this was where I began to form the basics of software development with miniscule scripts to create weapons, which taught me valuable information early on such as file structure, naming conventions, data types, and other programming basics. <br><br> I had been a developer for many servers inside the community of the game, although primarily friend owned, for the creation of scripts for the server, primarily related to the gamemode 'DarkRP' within the game, and its various functions. I learned quite a bit about version control systems and FTP services, as well as website development for the servers communities.<br><br>While it was nothing truly indepth or mind blowing, it laid heavy groundworks for my future, and lead to an advantage in my senior year of high school where, in my first ever computer science / programming course, I was forced to catch up on six months worth of Java study in a week whenever I went virtual. Not only did I catch up in a week, I finished the course in two, and had a solid understanding of Java by the end of it. I haven't used it in a while, so the syntax is hazy, but it lead to a much easier time understanding C++ in my most recent computer science classes.<br><br>In essence, I was closer to a \"script kiddie\" than a \"programmer\"; however, a start is a start. In the words of Sir Francis Drake:<br><span class=\"cyber-bold-font\"><em>\"Sic Parvis Magna\" <br>(\"Greatness From Small Beginnings\")</em></span>", 
                    "Back in 2021, I happened to chance myself into the Left 4 Dead 2 co-op lobby of a lifetime. Seriously, it was that life changing. I had stumbled upon a user by the name of Gigan and some friends of his, who would later become not only close friends of my own but also my partners in the project which Gigan was the founder of and which I would later become ASSISTANT LEAD of.<br><br>During my time with the L4D2 Beta Project, made by our team now formally known as \"Sourcerer\", a play on the name of the engine in which our titular project ran, I led the team in discovery of how to properly modify the game files to alter the game in a way which no mod had really done prior to, such as changing entire game mechanics.<br><br> I created various mods for the project, with my biggest contribution being the initial version of the recreated 2009 beta \"The Parish\" campaign demo and a complete recreation of every UI graphic, which entailed also re-enabling them and changing the loading screen UI to mimic the look of the beta. This is where that discovery came into play, as it wasn't something many people in the community had done up until this point.<br><br>This experience was my first true \"team\" experience, and even in a position as a leader. I was responsible for not only helping Gigan, Peter, organize events and specific dates for media production, but also discovery of what needed to be added or fixed within the pack itself. This led me to having a major role in team communication and relaying tasks between the members. As of this year, the \"final version\" of the Beta Pack has been released. From now on, unless anything else happens to be discovered, the pack will mostly only recieve bug updates.<br><br>This truly was the experience of a lifetime. A passion project brought together by various loving members of the community, creating their own subcommunity for a very dedicated group of individuals who strive for a recreation of the pivotol moment in co-op gaming history.", 
                    "If it isn't already obvious, I have lived in the realm of content creation since a very young age. Not only did I start to make basic mod for games whenever I was 10 to 12, but I created my first YouTube channel whenever I was only 9, seeking to be the next PewDiePie. Sadly, even though he and I, according to some, share many looks, I never had the same luck that he had; however, that never got me to give up in trying.<br><br>Content creation has been a huge part of my life from a very young age, and has taught me so many skills, from internet safety to a base understanding of the Adobe suite, as well as the quick adaptability of learning new techniques for a variety of skills. While I am colorblind, and that puts me at an extreme disadvantage on the side of graphic design, it is a passion of mine. I am certainly no professional, nor am I capable of many things such as vector art, as I am artistically disinclined at the moment, as I haven't trained those metaphorical muscles enough, but I do consider myself to be quite a bit better than the average Adobe noob.<br><br>While I haven't uploaded anything major in the last several months, and while my content is not anything riveting, it is a passion I would like to pursue as a potential alternative career or secondary hustle. While my primary focus is certainly a career in the field of Information Technology, there are various skills within my content creation \"career\", if you can call it that, that have enhanced my abilities in all fields. Primarily, content creation led to an increased adaptability and problem solving. Whenever I had an effect I wanted to do, or edit a certain way, I had to figure it out with any means possible or available to me. It led to years of constant learning and upping my ability to adapt.<br><br>I have a passion for content creation, from scripting and editing to voice over and graphic work. I've been putting off making videos for the last few months, but I do have plenty of ideas for new videos. I typically just make what I want, when I want, how I want, with no real rhyme or reason to it, so long as I enjoy doing it. I've had several YouTube accounts over the years, with my most recent one being <strong><em>Wickynii</em></strong>."
                    ],
        "img": ["", "./styles/imgs/projects/l4d_beta_pack.png", "./styles/imgs/projects/youtube-channel.png"]
    }
]