[
    {
        "header" : "PROGRAMMER, DESIGNER, CREATOR.",
        "content": "Despite having been working in these three primary fields for over a decade now, from youth until my current place in college, I do not really have a lot to show for it, as I never really archived much of my old work, so the showcase is somewhat lacking; however, with my recent onset of classes and creation kicks on YouTube, I do have some recent content, even not in quantity, but it is relatively high quality."
    },
    {
        "header" : "MY WORK",
        "content" : ""
    },
    {
        "header" : "CIS 376 - Web Dev",
        "content" : "My \"portfolio\" work for my web dev class mostly consists of Labs, obviously, including this page, which, until this point, where incredibly rudamentary and at a time whenever I did not understand / did not know HTML, CSS, or JS.<br><br> The labs took place over the course of a single semester, with this page being the midterm (Foxtrot). The pages are separated into two distinct categories: Introductory and Intermediate. This page, Foxtrot, is the last of the Introductory pages.<br><br>Below you can find a link to the page full of the labs."
    },
    {
        "header" : "CIS 376 Labs",
        "content" : "These labs were constructed over the Fall 2023 semester in my Junior year at college." 
    },
    {
        "header" : "Graphic Design",
        "content" : "My foray into graphic design began as early as age 10 with making thumbnails for videos on my old YouTube channels; however, as time went on, the operations expanded, and I began to make banners, profile pictures, graphics for streams, and for events.<br><br>Much of my recent work was directly tied to the Esports organization at my University of which I was apart and for the my work on the L4D2 Beta Pack Project. Over the course of my time with both organizations my skills increased dramatically.<br><br>Below you can find a link to the page full of my graphic work."
    },
    {
        "header" : "Graphics",
        "content" : "While much of these graphics are recent, some are legacy content, so quality will vary."
    }
]